doctype 0 = "افتتاحيه حساب ها";
doctype 1 = "اختتاميه";
doctype 2 = "کنترلي و انتظامي";
doctype 3 = "عادي";
doctype 4 = "اصلاحي";
doctype 5 = "سيستم اموال";
doctype 6 = "سيستم كالا";
doctype 7 = "سيستم بودجه و اعتبارات";
doctype 8 = "سيستم دريافت پرداخت";
doctype 9 = "سيستم حقوق و دستمزد";
doctype 10 = "ايجاد سوابق اموال";
doctype 11 = "ايجاد سوابق كالا";
doctype 12 = "ارسالي از واحد";
doctype 13 = "سيستم تجميع اسناد";
------------------------------
State 0 = "پيش نويس";
State 1 = " در انتظار رسيدگي";
State 2 = "واخواهي شده";
State 3 = "آماده تامين اعتبار";
State 4 = "آماده ثبت عمليات دريافت - پرداخت";DocState 4 ---- صدور چک ---USP_ACC_SAVE_CONFIRMFORCHECK
State 5 = "آماده رسيدگي نهايي";
State 6 = "آماده تاييد وصول مستندات";
State 7 = "آماده ارسال";
State 8 = "نهايي شده";
State 9 = "آماده تاييد مقام مجاز جهت برداشت وجه";DocState 9 ---- مجوز صدور چک --execute USP_ACC_SAVE_AUDITDOC 1232514,20524,NULL,NULL,NULL,NULL,1,0
State 10 = "آماده تاييد مقام مجاز جهت ثبت";
State 11 = "آماده شناسائي كد اعتبار";
State 50 = "ثبت شده";
State 55 = "داراي كد اعتبار";
State 56 = "رسيدگي شده";
State 57 = "ثبت شده واحد";
State 100 = "کلي";

DocState 10 ---پیش نویس
DocState 1 ---رسیدگی
doc
DocState 5 ---رسیدگی نهایی 
DocState 6 ---تایید وصول مستندات
DocState 7 ---آماده ارسال به ستاد
DocState 8 ---اسناد نهایی

